Thanks @tombuildsstuff 
The problem still persists and I think the import is not working correctly, thats why I have opened a issue instead of a question.

Also the import of `azurerm_managed_disk` imports the resource group name in uppercase and not like it looks in Azure (lowercase)
```hcl
-/+ resource "azurerm_linux_virtual_machine" "dns-vm" {
        admin_username                  = "automatix"
        allow_extension_operations      = true
        computer_name                   = "dns1"
        disable_password_authentication = true
      ~ id                              = "/subscriptions/[ID]/resourceGroups/management-hub-1eu1-a/providers/Microsoft.Compute/virtualMachines/dns1" -> (known after apply)
        location                        = "westeurope"
        max_bid_price                   = -1
        name                            = "dns1"
        network_interface_ids           = [
            "/subscriptions/[ID]/resourceGroups/management-hub-1eu1-a/providers/Microsoft.Network/networkInterfaces/dns1-nic",
        ]
      + priority                        = "Regular" # forces replacement
      ~ private_ip_address              = "ip" -> (known after apply)
      ~ private_ip_addresses            = [
          - "100.66.16.4",
        ] -> (known after apply)
        provision_vm_agent              = true
      + public_ip_address               = (known after apply)
      ~ public_ip_addresses             = [] -> (known after apply)
        resource_group_name             = "management-hub-1eu1-a"
        size                            = "Standard_B1S"
        tags                            = {
            "managedBy" = "terraform"
            "owner"     = "coc-dit"
            "type"      = "dns"
        }
      ~ virtual_machine_id              = "id" -> (known after apply)
        zone                            = "1"

        admin_ssh_key {
            public_key = <<~EOT
                ssh-rsa key automation
            EOT
            username   = "user"
        }

        boot_diagnostics {
            storage_account_uri = "https://id.blob.core.windows.net/"
        }

      ~ os_disk {
            caching                   = "ReadWrite"
            disk_size_gb              = 128
            name                      = "dns1_OsDisk"
            storage_account_type      = "Standard_LRS"
            write_accelerator_enabled = false
        }

        source_image_reference {
            offer     = "CentOS"
            publisher = "OpenLogic"
            sku       = "7.6"
            version   = "latest"
        }

      - timeouts {}
    }

  # azurerm_managed_disk.registry must be replaced
-/+ resource "azurerm_managed_disk" "registry" {
        create_option        = "Empty"
      ~ disk_iops_read_write = 7500 -> (known after apply)
      ~ disk_mbps_read_write = 250 -> (known after apply)
        disk_size_gb         = 2000
      ~ id                   = "/subscriptions/[ID]/resourceGroups/MANAGEMENT-HUB-1EU1-A/providers/Microsoft.Compute/disks/registry_DataDisk" -> (known after apply)
        location             = "westeurope"
        name                 = "registry_DataDisk"
      ~ resource_group_name  = "MANAGEMENT-HUB-1EU1-A" -> "management-hub-1eu1-a" # forces replacement
      + source_uri           = (known after apply)
        storage_account_type = "Premium_LRS"
        tags                 = {
            "managedBy" = "terraform"
            "owner"     = "coc-dit"
            "type"      = "harbor"
        }
        zones                = [
            "1",
        ]

      - timeouts {}
    }

  # azurerm_virtual_machine_data_disk_attachment.capsule-disk-attach must be replaced
-/+ resource "azurerm_virtual_machine_data_disk_attachment" "capsule-disk-attach" {
      ~ caching                   = "None" -> "ReadWrite"
      ~ create_option             = "Empty" -> "Attach" # forces replacement
      ~ id                        = "/subscriptions/[ID]/resourceGroups/management-hub-1eu1-a/providers/Microsoft.Compute/virtualMachines/katello-capsule/dataDisks/katello-capsule_DataDisk" -> (known after apply)
        lun                       = 0
      ~ managed_disk_id           = "/subscriptions/[ID]/resourceGroups/MANAGEMENT-HUB-1EU1-A/providers/Microsoft.Compute/disks/katello-capsule_DataDisk" -> (known after apply) # forces replacement
      ~ virtual_machine_id        = "/subscriptions/[ID]/resourceGroups/management-hub-1eu1-a/providers/Microsoft.Compute/virtualMachines/katello-capsule" -> (known after apply) # forces replacement
        write_accelerator_enabled = false

      - timeouts {}
    }
```